-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 26, 2026 at 05:36 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `university_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `academic1`
--

CREATE TABLE `academic1` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `tuition` varchar(50) DEFAULT NULL,
  `bg_color` varchar(20) DEFAULT NULL,
  `image_path` varchar(255) DEFAULT NULL,
  `pdf_path` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `academic1`
--

INSERT INTO `academic1` (`id`, `title`, `content`, `tuition`, `bg_color`, `image_path`, `pdf_path`, `created_at`) VALUES
(1, 'ทำไมต้องไอโอที (IoT) ลาดกระบัง ?', 'หลักสูตรวิศวกรรมระบบไอโอทีและสารสนเทศ มุ่งเน้นที่การศึกษาการเชื่อมองค์ประกอบของโลกดิจิทัลเข้าด้วยกัน ทั้งศึกษาที่เรียนในหลักสูตรนี้จะได้ศึกษาและปฏิบัติเกี่ยวกับด้านเทคโนโลยีระบบไอโอทีและสารสนเทศโดยอาศัยความรู้พื้นฐาน ทั้งด้านซอฟต์แวร์ ประกอบด้วย การเขียนโปรแกรมคอมพิวเตอร์ การพัฒนาซอฟต์แวร์และแอพพลิเคชัน ด้านฮาร์ดแวร์ได้แก่ การพัฒนาอุปกรณ์อิเล็กทรอนิกส์อัจฉริยะและสมาร์ทเซ็นเซอร์ รวมถึงเชื่อมโยงเข้าหากันด้วย การศึกษาด้านการสื่อสารและเครือข่ายไปจนถึงการประยุกต์ใช้เทคโนโลยีปัญญาประดิษฐ์และวิทยาการข้อมูล โดยผสมผสานความรู้ต่าง ๆ เหล่านี้เข้ากับกระบวนการทางวิศวกรรมศาสตร์ คณิตศาสตร์ เพื่อออกแบบสร้างนวัตกรรมใหม่ ๆ รวมถึงการใช้งานในอุตสาหกรรมที่ต้องการระบบไอโอทีและไอที ส่งเสริมให้นักศึกษาต่อยอดนวัตกรรมของตนเองเพื่อผลิตใช้หรือทำเป็นสตาร์ทอัปเพื่อสร้างธุรกิจของตนเองได้\r\n', '25000', '#f4b183', 'uploads/1771867035_1771729888_pic1.png', 'uploads/1771867035_1771729888_ข้อมูลเพิ่ม-หลักสูตรIoT.pdf', '2026-02-23 17:17:15'),
(2, 'ทำไมต้องไอโอที (IoT) ลาดกระบัง ?', 'หลักสูตรวิศวกรรมระบบไอโอทีและสารสนเทศ มุ่งเน้นที่การศึกษาการเชื่อมองค์ประกอบของโลกดิจิทัลเข้าด้วยกัน ทั้งศึกษาที่เรียนในหลักสูตรนี้จะได้ศึกษาและปฏิบัติเกี่ยวกับด้านเทคโนโลยีระบบไอโอทีและสารสนเทศโดยอาศัยความรู้พื้นฐาน ทั้งด้านซอฟต์แวร์ ประกอบด้วย การเขียนโปรแกรมคอมพิวเตอร์ การพัฒนาซอฟต์แวร์และแอพพลิเคชัน ด้านฮาร์ดแวร์ได้แก่ การพัฒนาอุปกรณ์อิเล็กทรอนิกส์อัจฉริยะและสมาร์ทเซ็นเซอร์ รวมถึงเชื่อมโยงเข้าหากันด้วย การศึกษาด้านการสื่อสารและเครือข่ายไปจนถึงการประยุกต์ใช้เทคโนโลยีปัญญาประดิษฐ์และวิทยาการข้อมูล โดยผสมผสานความรู้ต่าง ๆ เหล่านี้เข้ากับกระบวนการทางวิศวกรรมศาสตร์ คณิตศาสตร์ เพื่อออกแบบสร้างนวัตกรรมใหม่ ๆ รวมถึงการใช้งานในอุตสาหกรรมที่ต้องการระบบไอโอทีและไอที ส่งเสริมให้นักศึกษาต่อยอดนวัตกรรมของตนเองเพื่อผลิตใช้หรือทำเป็นสตาร์ทอัปเพื่อสร้างธุรกิจของตนเองได้\r\n', '25000', '#f4b183', 'uploads/1771867469_1771729888_pic1.png', 'uploads/1771867469_1771729888_ข้อมูลเพิ่ม-หลักสูตรIoT.pdf', '2026-02-23 17:24:29');

-- --------------------------------------------------------

--
-- Table structure for table `academic2`
--

CREATE TABLE `academic2` (
  `id` int(11) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `content` text DEFAULT NULL,
  `tuition` varchar(100) DEFAULT NULL,
  `bg_color` varchar(20) DEFAULT NULL,
  `image_path` varchar(255) DEFAULT NULL,
  `pdf_path` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `academic2`
--

INSERT INTO `academic2` (`id`, `title`, `content`, `tuition`, `bg_color`, `image_path`, `pdf_path`, `created_at`) VALUES
(3, 'ทำไมต้องIoTe+Physics?', 'การบูรณาการระหว่างเทคโนโลยีไอโอที (IoT) และฟิสิกส์ (Physics) มีความสำคัญอย่างยิ่งต่อการพัฒนาวิศวกรรมยุคดิจิทัล เนื่องจากระบบไอโอทีไม่ได้อาศัยเพียงซอฟต์แวร์หรือการเขียนโปรแกรมเท่านั้น แต่ต้องเชื่อมโยงกับโลกกายภาพจริงผ่านอุปกรณ์ เซ็นเซอร์ และระบบอิเล็กทรอนิกส์ ซึ่งล้วนตั้งอยู่บนพื้นฐานของหลักการทางฟิสิกส์\r\n\r\nหลักสูตรวิศวกรรมระบบไอโอทีและสารสนเทศจึงมุ่งเน้นการผสมผสานองค์ความรู้ด้านเทคโนโลยีดิจิทัลเข้ากับหลักการทางวิทยาศาสตร์ โดยนักศึกษาจะได้ศึกษาและปฏิบัติทั้งด้านซอฟต์แวร์ เช่น การเขียนโปรแกรม การพัฒนาระบบและแอปพลิเคชัน การประมวลผลข้อมูล และปัญญาประดิษฐ์ ควบคู่ไปกับด้านฮาร์ดแวร์ ซึ่งเกี่ยวข้องกับการออกแบบวงจรอิเล็กทรอนิกส์ การพัฒนาอุปกรณ์สมาร์ทเซ็นเซอร์ และระบบฝังตัว\r\n\r\nความรู้ทางฟิสิกส์มีบทบาทสำคัญในการทำความเข้าใจกลไกการทำงานของเซ็นเซอร์ การวัดปริมาณทางกายภาพ เช่น อุณหภูมิ ความดัน แรง แสง หรือคลื่นแม่เหล็กไฟฟ้า ตลอดจนหลักการด้านไฟฟ้าและแม่เหล็กที่เกี่ยวข้องกับการสื่อสารและพลังงาน หากขาดพื้นฐานฟิสิกส์ การออกแบบระบบไอโอทีที่มีความแม่นยำ เสถียร และปลอดภัยจะไม่สามารถทำได้อย่างมีประสิทธิภาพ\r\n\r\nนอกจากนี้ หลักสูตรยังส่งเสริมให้นักศึกษานำความรู้ทางฟิสิกส์ คณิตศาสตร์ และกระบวนการทางวิศวกรรมศาสตร์ มาประยุกต์ใช้ร่วมกับเทคโนโลยีไอโอทีและสารสนเทศ เพื่อออกแบบและสร้างนวัตกรรมที่สามารถแก้ไขปัญหาในภาคอุตสาหกรรม ภาคเกษตรกรรม เมืองอัจฉริยะ และระบบอัตโนมัติสมัยใหม่ได้อย่างเป็นรูปธรรม\r\n\r\nการเรียนรู้แบบบูรณาการระหว่าง IoT และ Physics จึงไม่เพียงแต่ทำให้นักศึกษามีความเข้าใจทั้งเชิงทฤษฎีและปฏิบัติ แต่ยังช่วยพัฒนาศักยภาพในการคิดวิเคราะห์ การออกแบบระบบครบวงจร (End-to-End System Design) และการต่อยอดสู่การพัฒนาผลิตภัณฑ์ นวัตกรรม หรือธุรกิจสตาร์ทอัปในอนาคตได้อย่างมั่นคงและยั่งยืน', '40000', '#ffffff', 'uploads/1771730963_messageImage_1720375388545-1024x576.jpg', 'uploads/1771730963_ACFrOgA-9cDG5lojXPLftVM0sS7cEoAQjjuGl04IfLr1wTN6GMaFkAar6C4thqG79wJkeeLBSimpFHcPg0MhkvEmCTdJX6WRRdVipzt90Fl7j44tPP_qQLtO2_6CuRkEEAZIHdPw2qtH5Rn-bGH3.pdf', '2026-02-22 03:29:23'),
(4, 'ทำไมต้องIoTe+Physics?', 'การบูรณาการระหว่างเทคโนโลยีไอโอที (IoT) และฟิสิกส์ (Physics) มีความสำคัญอย่างยิ่งต่อการพัฒนาวิศวกรรมยุคดิจิทัล เนื่องจากระบบไอโอทีไม่ได้อาศัยเพียงซอฟต์แวร์หรือการเขียนโปรแกรมเท่านั้น แต่ต้องเชื่อมโยงกับโลกกายภาพจริงผ่านอุปกรณ์ เซ็นเซอร์ และระบบอิเล็กทรอนิกส์ ซึ่งล้วนตั้งอยู่บนพื้นฐานของหลักการทางฟิสิกส์\n\nหลักสูตรวิศวกรรมระบบไอโอทีและสารสนเทศจึงมุ่งเน้นการผสมผสานองค์ความรู้ด้านเทคโนโลยีดิจิทัลเข้ากับหลักการทางวิทยาศาสตร์ โดยนักศึกษาจะได้ศึกษาและปฏิบัติทั้งด้านซอฟต์แวร์ เช่น การเขียนโปรแกรม การพัฒนาระบบและแอปพลิเคชัน การประมวลผลข้อมูล และปัญญาประดิษฐ์ ควบคู่ไปกับด้านฮาร์ดแวร์ ซึ่งเกี่ยวข้องกับการออกแบบวงจรอิเล็กทรอนิกส์ การพัฒนาอุปกรณ์สมาร์ทเซ็นเซอร์ และระบบฝังตัว\n\nความรู้ทางฟิสิกส์มีบทบาทสำคัญในการทำความเข้าใจกลไกการทำงานของเซ็นเซอร์ การวัดปริมาณทางกายภาพ เช่น อุณหภูมิ ความดัน แรง แสง หรือคลื่นแม่เหล็กไฟฟ้า ตลอดจนหลักการด้านไฟฟ้าและแม่เหล็กที่เกี่ยวข้องกับการสื่อสารและพลังงาน หากขาดพื้นฐานฟิสิกส์ การออกแบบระบบไอโอทีที่มีความแม่นยำ เสถียร และปลอดภัยจะไม่สามารถทำได้อย่างมีประสิทธิภาพ\n\nนอกจากนี้ หลักสูตรยังส่งเสริมให้นักศึกษานำความรู้ทางฟิสิกส์ คณิตศาสตร์ และกระบวนการทางวิศวกรรมศาสตร์ มาประยุกต์ใช้ร่วมกับเทคโนโลยีไอโอทีและสารสนเทศ เพื่อออกแบบและสร้างนวัตกรรมที่สามารถแก้ไขปัญหาในภาคอุตสาหกรรม ภาคเกษตรกรรม เมืองอัจฉริยะ และระบบอัตโนมัติสมัยใหม่ได้อย่างเป็นรูปธรรม\n\nการเรียนรู้แบบบูรณาการระหว่าง IoT และ Physics จึงไม่เพียงแต่ทำให้นักศึกษามีความเข้าใจทั้งเชิงทฤษฎีและปฏิบัติ แต่ยังช่วยพัฒนาศักยภาพในการคิดวิเคราะห์ การออกแบบระบบครบวงจร (End-to-End System Design) และการต่อยอดสู่การพัฒนาผลิตภัณฑ์ นวัตกรรม หรือธุรกิจสตาร์ทอัปในอนาคตได้อย่างมั่นคงและยั่งยืน', '40000', '#f4b185', 'uploads/1771731198_messageImage_1720375388545-1024x576.jpg', 'uploads/1771731198_ACFrOgA-9cDG5lojXPLftVM0sS7cEoAQjjuGl04IfLr1wTN6GMaFkAar6C4thqG79wJkeeLBSimpFHcPg0MhkvEmCTdJX6WRRdVipzt90Fl7j44tPP_qQLtO2_6CuRkEEAZIHdPw2qtH5Rn-bGH3.pdf', '2026-02-22 03:33:18'),
(6, 'ทำไมต้องIoTe+Physics?', 'การบูรณาการระหว่างเทคโนโลยีไอโอที (IoT) และฟิสิกส์ (Physics) มีความสำคัญอย่างยิ่งต่อการพัฒนาวิศวกรรมยุคดิจิทัล เนื่องจากระบบไอโอทีไม่ได้อาศัยเพียงซอฟต์แวร์หรือการเขียนโปรแกรมเท่านั้น แต่ต้องเชื่อมโยงกับโลกกายภาพจริงผ่านอุปกรณ์ เซ็นเซอร์ และระบบอิเล็กทรอนิกส์ ซึ่งล้วนตั้งอยู่บนพื้นฐานของหลักการทางฟิสิกส์\r\n\r\nหลักสูตรวิศวกรรมระบบไอโอทีและสารสนเทศจึงมุ่งเน้นการผสมผสานองค์ความรู้ด้านเทคโนโลยีดิจิทัลเข้ากับหลักการทางวิทยาศาสตร์ โดยนักศึกษาจะได้ศึกษาและปฏิบัติทั้งด้านซอฟต์แวร์ เช่น การเขียนโปรแกรม การพัฒนาระบบและแอปพลิเคชัน การประมวลผลข้อมูล และปัญญาประดิษฐ์ ควบคู่ไปกับด้านฮาร์ดแวร์ ซึ่งเกี่ยวข้องกับการออกแบบวงจรอิเล็กทรอนิกส์ การพัฒนาอุปกรณ์สมาร์ทเซ็นเซอร์ และระบบฝังตัว\r\n\r\nความรู้ทางฟิสิกส์มีบทบาทสำคัญในการทำความเข้าใจกลไกการทำงานของเซ็นเซอร์ การวัดปริมาณทางกายภาพ เช่น อุณหภูมิ ความดัน แรง แสง หรือคลื่นแม่เหล็กไฟฟ้า ตลอดจนหลักการด้านไฟฟ้าและแม่เหล็กที่เกี่ยวข้องกับการสื่อสารและพลังงาน หากขาดพื้นฐานฟิสิกส์ การออกแบบระบบไอโอทีที่มีความแม่นยำ เสถียร และปลอดภัยจะไม่สามารถทำได้อย่างมีประสิทธิภาพ\r\n\r\nนอกจากนี้ หลักสูตรยังส่งเสริมให้นักศึกษานำความรู้ทางฟิสิกส์ คณิตศาสตร์ และกระบวนการทางวิศวกรรมศาสตร์ มาประยุกต์ใช้ร่วมกับเทคโนโลยีไอโอทีและสารสนเทศ เพื่อออกแบบและสร้างนวัตกรรมที่สามารถแก้ไขปัญหาในภาคอุตสาหกรรม ภาคเกษตรกรรม เมืองอัจฉริยะ และระบบอัตโนมัติสมัยใหม่ได้อย่างเป็นรูปธรรม\r\n\r\nการเรียนรู้แบบบูรณาการระหว่าง IoT และ Physics จึงไม่เพียงแต่ทำให้นักศึกษามีความเข้าใจทั้งเชิงทฤษฎีและปฏิบัติ แต่ยังช่วยพัฒนาศักยภาพในการคิดวิเคราะห์ การออกแบบระบบครบวงจร (End-to-End System Design) และการต่อยอดสู่การพัฒนาผลิตภัณฑ์ นวัตกรรม หรือธุรกิจสตาร์ทอัปในอนาคตได้อย่างมั่นคงและยั่งยืน', '40000', '#f4b183', 'uploads/1772118391_messageImage_1720375388545-1024x576.jpg', 'uploads/1772118391_1771730596_ACFrOgA-9cDG5lojXPLftVM0sS7cEoAQjjuGl04IfLr1wTN6GMaFkAar6C4thqG79wJkeeLBSimpFHcPg0MhkvEmCTdJX6WRRdVipzt90Fl7j44tPP_qQLtO2_6CuRkEEAZIHdPw2qtH5Rn-bGH3.pdf', '2026-02-26 15:06:31'),
(7, 'ทำไมต้องIoTe+Physics?', 'การบูรณาการระหว่างเทคโนโลยีไอโอที (IoT) และฟิสิกส์ (Physics) มีความสำคัญอย่างยิ่งต่อการพัฒนาวิศวกรรมยุคดิจิทัล เนื่องจากระบบไอโอทีไม่ได้อาศัยเพียงซอฟต์แวร์หรือการเขียนโปรแกรมเท่านั้น แต่ต้องเชื่อมโยงกับโลกกายภาพจริงผ่านอุปกรณ์ เซ็นเซอร์ และระบบอิเล็กทรอนิกส์ ซึ่งล้วนตั้งอยู่บนพื้นฐานของหลักการทางฟิสิกส์\r\n\r\nหลักสูตรวิศวกรรมระบบไอโอทีและสารสนเทศจึงมุ่งเน้นการผสมผสานองค์ความรู้ด้านเทคโนโลยีดิจิทัลเข้ากับหลักการทางวิทยาศาสตร์ โดยนักศึกษาจะได้ศึกษาและปฏิบัติทั้งด้านซอฟต์แวร์ เช่น การเขียนโปรแกรม การพัฒนาระบบและแอปพลิเคชัน การประมวลผลข้อมูล และปัญญาประดิษฐ์ ควบคู่ไปกับด้านฮาร์ดแวร์ ซึ่งเกี่ยวข้องกับการออกแบบวงจรอิเล็กทรอนิกส์ การพัฒนาอุปกรณ์สมาร์ทเซ็นเซอร์ และระบบฝังตัว\r\n\r\nความรู้ทางฟิสิกส์มีบทบาทสำคัญในการทำความเข้าใจกลไกการทำงานของเซ็นเซอร์ การวัดปริมาณทางกายภาพ เช่น อุณหภูมิ ความดัน แรง แสง หรือคลื่นแม่เหล็กไฟฟ้า ตลอดจนหลักการด้านไฟฟ้าและแม่เหล็กที่เกี่ยวข้องกับการสื่อสารและพลังงาน หากขาดพื้นฐานฟิสิกส์ การออกแบบระบบไอโอทีที่มีความแม่นยำ เสถียร และปลอดภัยจะไม่สามารถทำได้อย่างมีประสิทธิภาพ\r\n\r\nนอกจากนี้ หลักสูตรยังส่งเสริมให้นักศึกษานำความรู้ทางฟิสิกส์ คณิตศาสตร์ และกระบวนการทางวิศวกรรมศาสตร์ มาประยุกต์ใช้ร่วมกับเทคโนโลยีไอโอทีและสารสนเทศ เพื่อออกแบบและสร้างนวัตกรรมที่สามารถแก้ไขปัญหาในภาคอุตสาหกรรม ภาคเกษตรกรรม เมืองอัจฉริยะ และระบบอัตโนมัติสมัยใหม่ได้อย่างเป็นรูปธรรม\r\n\r\nการเรียนรู้แบบบูรณาการระหว่าง IoT และ Physics จึงไม่เพียงแต่ทำให้นักศึกษามีความเข้าใจทั้งเชิงทฤษฎีและปฏิบัติ แต่ยังช่วยพัฒนาศักยภาพในการคิดวิเคราะห์ การออกแบบระบบครบวงจร (End-to-End System Design) และการต่อยอดสู่การพัฒนาผลิตภัณฑ์ นวัตกรรม หรือธุรกิจสตาร์ทอัปในอนาคตได้อย่างมั่นคงและยั่งยืน', '40000', '#f4b183', 'uploads/1772119103_1772118391_messageImage_1720375388545-1024x576.jpg', 'uploads/1772119103_1771730596_ACFrOgA-9cDG5lojXPLftVM0sS7cEoAQjjuGl04IfLr1wTN6GMaFkAar6C4thqG79wJkeeLBSimpFHcPg0MhkvEmCTdJX6WRRdVipzt90Fl7j44tPP_qQLtO2_6CuRkEEAZIHdPw2qtH5Rn-bGH3.pdf', '2026-02-26 15:18:23');

-- --------------------------------------------------------

--
-- Table structure for table `internships`
--

CREATE TABLE `internships` (
  `id` int(11) NOT NULL,
  `company` varchar(255) DEFAULT NULL,
  `position` varchar(255) DEFAULT NULL,
  `date_range` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `details` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `internships`
--

INSERT INTO `internships` (`id`, `company`, `position`, `date_range`, `image`, `details`) VALUES
(17, 'บริษัท CyberSecure Thailand จำกัด', 'Cybersecurity Analyst Intern', 'พฤษภาคม 2024 - กรกฎาคม 2024', '1771746399_Intern1.jpg', 'วิเคราะห์ log จาก firewall และ SIEM, ตรวจจับพฤติกรรมผิดปกติ (Anomaly Detection), ทดสอบเจาะระบบ (Pentest) ภายในองค์กร, เขียนรายงานสรุปช่องโหว่, พัฒนา script อัตโนมัติด้วย Python'),
(18, 'บริษัท DataWave Analytics', 'AI Developer Intern', 'ธันวาคม 2024 - กุมภาพันธ์ 2025', '1771746430_Intern2.jpg', 'พัฒนาโมเดล Machine Learning สำหรับตรวจจับบัญชีม้า, เตรียม dataset และทำ feature engineering, เทรนโมเดลด้วย TensorFlow, วิเคราะห์ผลด้วย Confusion Matrix, Deploy โมเดลขึ้น server'),
(21, 'บริษัท SmartTech Solutions จำกัด', 'IoT System Developer Intern', 'มิถุนายน 2025 – สิงหาคม 2025', '1771870894_1771736454_163F5BC9-75A1-4625-AFE1-425F517602FA.jpg', 'พัฒนา dashboard แสดงผล sensor แบบ real-time เขียน API เชื่อมต่อฐานข้อมูล MQL\r\nออกแบบระบบแจ้งเตือนผ่าน Line Notify\r\nวิเคราะห์ข้อมูลด้วย Python\r\nทดสอบระบบและเขียนเอกสารคู่มือการใช้งาน'),
(26, NULL, NULL, NULL, '', NULL),
(27, NULL, NULL, NULL, '', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `academic1`
--
ALTER TABLE `academic1`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `academic2`
--
ALTER TABLE `academic2`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `internships`
--
ALTER TABLE `internships`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `academic1`
--
ALTER TABLE `academic1`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `academic2`
--
ALTER TABLE `academic2`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `internships`
--
ALTER TABLE `internships`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
